<template>
  <div class="all">
    <el-container class="nav-index">
      <router-link to="/result/regional">地域风物</router-link>
      <router-link to="/result/history">口述历史</router-link>
      <router-link to="/result/compilation">史料汇编</router-link>
      <router-link to="/result/archive">档案汇编</router-link>
    </el-container>
    <el-container class="content">
      <el-container class="his-word">
        <p>
          线下调研过程中，团队于各地档案馆检索出近两万份档案，内容极为丰富，全面再现两校西迁的方方面面，但受限于客观因素，仅整理带回部分档案，以下罗列部分，若需了解更多信息，请联系南京大学档案馆。
        </p>
      </el-container>
      <el-table :data="JinLingData" class="table">
        <el-table-column prop="account" label="档案号" width="350px" />
        <el-table-column prop="name" label="题名" width="600px" />
        <el-table-column prop="date" label="日期" width="200px" />
      </el-table>
      <h2>金陵大学部分档案</h2>
      <el-table :data="ZhongyangData" class="table">
        <el-table-column prop="account" label="档案号" width="350px" />
        <el-table-column prop="name" label="题名" width="600px" />
        <el-table-column prop="date" label="日期" width="200px" />
      </el-table>
      <h2>国立中央大学部分档案</h2>
      <el-table :data="SichuanData" class="table">
        <el-table-column prop="account" label="档案号" width="350px" />
        <el-table-column prop="name" label="题名" width="600px" />
        <el-table-column prop="date" label="日期" width="200px" />
      </el-table>
      <h2>四川省农改所部分档案</h2>
    </el-container>
  </div>
</template>
<script>
export default {
  data() {
    return {
      JinLingData: [
        {
          account: "0019-0001-00086·0000-038",
          name: "关于补发金陵大学理学院所购纱包钱余款结算单收据的函",
          date: "1941年10月03日",
        },
        {
          account: "0019-0001-00086·0000-039",
          name: "关于拨售金陵大学理学院电械工程系所需双纱线致经济部工矿调整处材料库的函",
          date: "1941年07月10日",
        },
        {
          account: "0019-0001-00086·0000-040",
          name: "关于检送金陵大学理学院制造变压器所需材料购料单致经济部工矿调整处材料组的函",
          date: "1941年02月12日",
        },
        {
          account: "0019-0001-00086·0000-041",
          name: "关于准予金陵大学理学院购买变压器油及双纱铜线致经济部工矿调整处的函",
          date: "1941年01月16日",
        },
        {
          account: "0019-0001-00086·0000-042",
          name: "关于价让金陵大学理学院所需双纱包线材料致经济部工矿调整处的函",
          date: "1940年07月13日",
        },
        {
          account: "0019-0001-00086·0000-043",
          name: "关于告知金陵大学理学院延期提取钢片致该学院的函",
          date: "1940年06月25日",
        },
        {
          account: "0019-0001-00086·0000-044",
          name: "关于暂缓提取金陵大学理学院所购各项货物致经济部工矿调整处的函",
          date: "1940年06月22日",
        },
        {
          account: "0019-0001-00086·0000-045",
          name: "关于准予价让金陵大学理学院所需各种沙包钢线致经济部工矿调整处的函",
          date: "1940年06月17日",
        },
        {
          account: "0019-0001-00086·0000-047",
          name: "关于准予金陵大学理学院备款购买电池致经济部工矿调整处的函",
          date: "1940年02月14日",
        },
        {
          account: "0019-0001-00086·0000-048",
          name: "关于补缴购矽钢片材料欠款致经济部工矿调整处材料库的函",
          date: "1940年12月28日",
        },
        {
          account: "0019-0001-00086·0000-051",
          name: "关于拨让金陵大学理学院所需矽钢片致经济部工矿调整处的函",
          date: "1939年10月30日",
        },
        {
          account: "0019-0001-00647·0000-010",
          name: "关于请惠寄出版刊物致四川省政府建设厅统计室、金陵大学农业经济系、四川省农业改进所的函",
          date: "1942年12月10日",
        },
        {
          account: "0019-0001-01040·0000-001",
          name: "关于检送购买锡、铅、锌数量致金陵大学理学院的函",
          date: "1943年04月20日",
        },
        {
          account: "0019-0001-01040·0000-002",
          name: "关于办理代购锡、铅、锌手续致经济部工矿调整处的函",
          date: "1943年04月20日",
        },
        {
          account: "0022-0001-00075·0000-052·000",
          name: "关于请按月发寄并补发1941年10月份起至1942年3月份止各类物价指数的往来函",
          date: "1942年04月01日",
        },
        {
          account: "0022-0001-00102·0000-059·000",
          name: "关于私立金陵大学派员采购平价货物致经济部平价购销处成都专员办公处的函",
          date: "19xx年03月14日",
        },
        {
          account: "0022-0001-00102·0000-103·000",
          name: "关于经济部平价购销处核查私立金陵大学采购平价货物致经济部平价购销处驻成都专员办公室的公函",
          date: "1942年10月15日",
        },
        {
          account: "0022-0001-00202·0000-014·000",
          name: "关于办理私立金陵大学代学生购买日用必需品的来往函",
          date: "1943年05月01日",
        },
        {
          account: "0022-0001-00203·0000-172·000",
          name: "关于填送1941、1942年度全川菜籽产量统计表的公函",
          date: "1943年04月03日",
        },
        {
          account: "0051-0002-00572-0000-001-000",
          name: "有限责任金陵大学理学院员生消费合作社登记表",
          date: "不详",
        },
        {
          account: "0053-0008-00104-0000-039-000",
          name: "关于检送成都生活费之研究致金陵大学农学院的笺函",
          date: "1941年06月05日",
        },
        {
          account: "0053-0011-00071-0000-111-001",
          name: "关于报送私立金陵大学要览的函",
          date: "194x年05月xx日",
        },
        {
          account: "0053-0011-00082-0000-007-000",
          name: "关于鸣谢新重庆月刊社惠赠《新重庆社会问题专辑》的函",
          date: "1947年11月17日",
        },
        {
          account: "0053-0011-00082-0000-008-000",
          name: "关于感谢新重庆月刊社惠赠《新重庆创刊号》的函",
          date: "1947年09月29日",
        },
        {
          account: "0053-0032-00382-0000-088-000",
          name: "金陵大学校刊",
          date: "不详",
        },
        {
          account: "0057-0012-00011·0000-044·000",
          name: "关于规定宣誓期限的函",
          date: "1945年11月21日",
        },
        {
          account: "0057-0012-00066·0000-065·000",
          name: "关于造送学生名册致第七区区公所的函",
          date: "1945年12月28日",
        },
        {
          account: "0060-0001-00012·0000-042",
          name: "夏生凯关于报送金陵大学农专科毕业班学生工作情形上重庆市社会局的呈",
          date: "1948年10月03日",
        },
        {
          account: "0060-0002-01370·0000-001",
          name: "重庆市社会局、私立金陵大学理学院关于组织员生消费合作社请准登记的公函、指令。附：社员名册、章程等",
          date: "1943年11月08日",
        },
        {
          account: "0060-0002-01370·0000-002",
          name: "重庆市社会局、私立金陵大学理学院关于报送图记启用日期及职员印鉴纸的呈。附：印鉴纸等",
          date: "1943年12月02日",
        },
        {
          account: "0060-0007-00002·0000-021",
          name: "重庆市社会局关于准更改名称给私立金陵大学附属中学重庆同学会的指令",
          date: "19xx年02月03日",
        },
        {
          account: "0060-0007-00002·0000-022",
          name: "私立金陵大学附属中学重庆同学会关于私立南京金陵中学重庆同学会已改名为私立金陵大学附属中学重庆同学会尚重庆市社会局的呈",
          date: "1943年12月23日",
        },
        {
          account: "0060-0007-00002·0000-023",
          name: "重庆市社会局关于补正会员、职员名册等及缴纳图记工本费给私立南京大学附属中学重庆同学会的指令",
          date: "1944年04月02日",
        },
        {
          account: "0060-0007-00002·0000-024",
          name: "私立金陵大学附属中学重庆同学会关于报送会员名册、章程等及请颁发立案证书、图记上重庆市社会局的呈。附：章程、成立大会会议记录",
          date: "1943年12月31日",
        },
        {
          account: "0060-0007-00002·0000-025",
          name: "金陵大学同学会重庆分会关于报送召开秋季大会日期并请准登记上重庆市社会局的呈",
          date: "1942年10月24日",
        },
        {
          account: "0060-0007-00002·0000-026",
          name: "重庆市社会局关于检送金陵大学同学会重庆分会发起人略历册请派员调查该会组织情形致重庆市党部的公函",
          date: "1943年12月10日",
        },
        {
          account: "0060-0007-00002·0000-027",
          name: "高秉坊、鲁佩璋、杭立武等关于请准成立金陵大学同学会重庆分会上重庆市社会局的呈。附：发起人名册",
          date: "1943年11月17日",
        },
        {
          account: "0060-0007-00002·0000-028",
          name: "重庆市社会局关于补办金陵大学同学会重庆分会登记手续致高秉坊的函",
          date: "1943年11月27日",
        },
        {
          account: "0060-0007-00002·0000-029",
          name: "重庆市社会局关于派马云为组织指导员及限报章程、会员名册等给金陵大学同学会重庆分会的批",
          date: "1944年01月28日",
        },
        {
          account: "0060-0007-00002·0000-030",
          name: "中国国民党重庆市执行委员会关于检送金陵大学同学会重庆分会审查意见表致重庆市社会局的公函",
          date: "1943年12月23日",
        },
        {
          account: "0060-0007-00079·0000-004",
          name: "金陵大学重庆同学会发起人履历册",
          date: "不详",
        },
        {
          account: "0060-0011-00371·0000-008",
          name: "关于联合当地党政军各界举行纪念会致金陵大学理学院的函",
          date: "不详",
        },
        {
          account: "0061-0015-03013·0000-017·000",
          name: "关于协助金陵大学学生参观工厂的训令、通令",
          date: "不详",
        },
        {
          account: "0065-0001-00604·0000-031·000",
          name: "关于告知本局电教工作队队址致金陵大学理学院的公函",
          date: "1946年03月14日",
        },
        {
          account: "0065-0001-00604·0000-033·000",
          name: "关于转知金陵大学重庆市教育局电教队详细地址上教育部的呈",
          date: "1946年03月xx日",
        },
        {
          account: "0065-0001-00606·0000-085·000",
          name: "关于购置办学静映卷片的呈、训令、函",
          date: "1948年03月02日",
        },
        {
          account: "0065-0001-00623·0000-253·000",
          name: "关于订阅电影与播音刊物致重庆市教育局的函",
          date: "1947年04月22日",
        },
        {
          account: "0065-0001-01625·0000-209·000",
          name: "金陵大学战区教职员子弟自修班补试初中会考学生成绩表、补考试题",
          date: "不详",
        },
        {
          account: "0065-0001-01267·0000-196·000",
          name: "关于抄发私立金陵大学电化专修科各省市报送学生入学办法给重庆市教育局的训令，附",
          date: "1944年05月03日",
        },
        {
          account: "0065-0001-01306·0000-010·000",
          name: "关于查复李家禧证件情形的公函",
          date: "1947年07月xx日",
        },
      ],
      ZhongyangData: [
        {
          account: "0312-0001-00033·0000-038·000",
          name: "国立中央大学会计组关于本组担保教职员、学生取款证明改用国立中央大学出纳室印章致中南银行的函",
          date: "不详",
        },
        {
          account: "0316-0001-00014·0000-056·000",
          name: "国立中央大学出纳室关于检送本室担保证明汇款印鉴式样致新华信托储蓄银行的函",
          date: "不详",
        },
        {
          account: "0323-0001-00043·0000-055·000",
          name: "交通部全国船舶调配委员会、国立中央大学关于分配船只运输还都复员的公函、代电",
          date: "不详",
        },
        {
          account: "0326-0001-00001·0000-062·000",
          name: "关于分批承运国立中央大学留渝办事处剩余公物并检送运价表的函",
          date: "1947年04月30日",
        },
        {
          account: "0328-0001-00056·0100-023·000",
          name: "关于协助国立中央大学师生在宜昌换船致民生实业股份有限公司的公函",
          date: "1946年08月16日",
        },
        {
          account: "0328-0001-00074·0100-109·000",
          name: "关于优待国立中央大学学生搭船致民生实业股份有限公司的函",
          date: "1937年07月27日",
        },
        {
          account: "0328-0001-00074·0100-156·000",
          name: "关于优待田朝畯搭船返校致民生实业股份有限公司的函",
          date: "1937年07月16日",
        },
        {
          account: "0328-0001-00074·0100-158·000",
          name: "关于优待张光孚搭船返校致民生实业股份有限公司的函",
          date: "1937年07月13日",
        },
        {
          account: "0328-0001-00074·0100-165·000",
          name: "关于优待陆寿宁搭船返校致民生实业股份有限公司的函",
          date: "1937年07月xx日",
        },
        {
          account: "0328-0001-00074·0100-168·000",
          name: "关于优待关吉凯搭船致民生实业股份有限公司的函",
          date: "1937年xx月xx日",
        },
        {
          account: "0328-0001-00074·0200-207·000",
          name: "关于优待袁明忻搭船返校致民生实业股份有限公司的函",
          date: "不详",
        },
        {
          account: "0328-0001-00074·0200-300·000",
          name: "关于优待杜若滋、阮曙航搭船致民生实业股份有限公司的函",
          date: "不详",
        },
        {
          account: "0328-0001-00074·0200-302·000",
          name: "关于优待杨佳骥搭船致民生实业股份有限公司的函",
          date: "不详",
        },
        {
          account: "0328-0001-00074·0200-319·000",
          name: "关于优待陈维城搭船致民生实业有限公司的函",
          date: "不详",
        },
        {
          account: "0328-0001-00090·0100-070·000",
          name: "关于借用民生实业股份有限公司所属民生工厂空地的公函",
          date: "1937年10月19日",
        },
        {
          account: "0334-0002-00007·0100-105·000",
          name: "国立中央大学总务处关于派王酉亭为校车代表人致军事委员会运输统制局重庆公共汽车管理处的函",
          date: "不详",
        },
        {
          account: "0334-0002-00022·0000-053·000",
          name: "国立中央大学关于已收到行车证及特约证致运输统制局重庆公共汽车管理处的函",
          date: "不详",
        },
        {
          account: "0334-0002-00022·0000-054·000",
          name: "国立中央大学、运输统制局重庆公共汽车管理处关于增开校车、在上清寺、川东师范增设车站的函",
          date: "不详",
        },
        {
          account: "0334-0002-00022·0000-056·000",
          name: "国立中央大学关于填送特约校车登记表致运输统制局重庆公共汽车管理处的公函",
          date: "不详",
        },
        {
          account: "0334-0002-00022·0000-118·000",
          name: "运输统制局重庆公共汽车管理处、重庆私立东方中学、国立中央大学等关于填送特约校车登记表的呈、函",
          date: "不详",
        },
        {
          account: "0334-0002-00023·0000-034·000",
          name: "交通部公路总局重庆公共汽车管理处关于告知校车管理机关致国立中央大学、国立重庆大学、私立建川中学等的函",
          date: "不详",
        },
        {
          account: "0336-0001-00121·0000-104·000",
          name: "关于请国立中央大学理科研究所寄送志刊致国立中央大学理科研究所的函",
          date: "19xx年03月03日",
        },
        {
          account: "0339-0001-00189·0000-228·000",
          name: "交通部邮政总局关于准搭国立中正医学院、国立中央大学人员致该院的函",
          date: "不详",
        },
        {
          account: "0340-0002-00013·0200-464·000",
          name: "国立中央大学关于请迅予回复沙坪坝邮局致东川邮政管理局的函",
          date: "不详",
        },
        {
          account: "0340-0002-00120·0100-210·000",
          name: "交通部邮政总局关于严密彻查国立中央大学刘仲友举报沙坪坝邮局长左原私亏公款经营生意案给东川邮政管理局的训令",
          date: "不详",
        },
        {
          account: "0340-0002-00394·0100-393·000",
          name: "东川邮政管理局关于退回预留印鉴致国立中央大学的函",
          date: "不详",
        },
        {
          account: "0340-0002-00397·0100-146·000",
          name: "东川邮政管理局关于寄送化工系学生俞剑华缴款书及中学证明书致国立中央大学柏溪分校的函",
          date: "不详",
        },
        {
          account: "0340-0002-00416·0100-382·000",
          name: "交通部邮政总局关于追查教育部由汉口寄重庆主计处、审计部、司法行政部及国立中央大学之保国已否投交收件人给东川邮政管理局的快邮代电",
          date: "不详",
        },
        {
          account: "0340-0002-00456·0300-999·046",
          name: "国立中央大学xxx关于尚未收到第0043、0924号快信致东川邮政管理局的函",
          date: "不详",
        },
        {
          account: "0340-0002-00480·0200-193·000",
          name: "国立中央大学分校主任办公室关于无法查明寄郾师三民主义青年团收小包致东川邮政管理局的函",
          date: "不详",
        },
        {
          account: "0340-0002-00513·0200-346·000",
          name: "东川邮政管理局关于准予《文史哲季刊》及《社会科学季刊》变更登记国立中央大学出版社的公函",
          date: "不详",
        },
        {
          account: "0340-0002-00513·0200-348·000",
          name: "国立中央大学关于请将执照寄送至内政部登记致东川邮政管理局的函",
          date: "不详",
        },
        {
          account: "0340-0002-00520·0100-001·000",
          name: "东川邮政管理局、国立中央大学出版社关于变更登记《文史哲季刊》的函",
          date: "不详",
        },
        {
          account: "0340-0002-00520·0100-019·000",
          name: "东川邮政管理局关于更正《文史哲季刊》、《社会科学季刊》新闻纸类登记执照致国立中央大学出版社的公函",
          date: "不详",
        },
        {
          account: "0340-0002-00520·0100-028·000",
          name: "国立中央大学出版组关于请更改《文史哲季刊》、《社会科学季刊》新闻纸类登记执照申请人姓名致东川邮政管理局的函",
          date: "不详",
        },
        {
          account: "0340-0002-00520·0100-294·000",
          name: "国立中央大学关于补送《文史哲季刊》样刊致东川邮政管理局的函",
          date: "不详",
        },
        {
          account: "0340-0002-00520·0100-331·000",
          name: "国立中央大学关于填送本校刊物新闻纸类登记申请书并补送样本致东川邮政管理局的函",
          date: "不详",
        },
        {
          account: "0340-0007-00003·0000-435·000",
          name: "东川邮政管理局、国立中央大学关于改汇重庆航委会经理处寄交陈冠康等奖金汇票至石牌邮局兑付的往来函",
          date: "不详",
        },
        {
          account: "0340-0009-00012·0100-235·000",
          name: "国立中央大学办公室、东川邮政管理局关于兑付第4450号汇票的往来函",
          date: "不详",
        },
        {
          account: "0342-0001-00017·0100-027·000",
          name: "关于请将汇票存根寄至沙坪坝邮局致北碚邮政储金汇业局的函",
          date: "19xx年11月18日",
        },
        {
          account: "0342-0001-00343·0000-083·000",
          name: "关于请赐给刘聚投考国立第二中学校、国立中央大学底数中学校投考证明致该校的函",
          date: "1945年07月30日",
        },
        {
          account: "0344-0001-00032·0000-004·000",
          name: "关于参观交通部重庆电话局的函",
          date: "1939年01月17日",
        },
        {
          account: "0344-0001-00032·0000-064·000",
          name: "关于欢迎学生于1941年2月27日及3月5、6两日参观致国立中央大学工学院的函",
          date: "1943年02月12日",
        },
        {
          account: "0344-0001-00032·0000-065·000",
          name: "关于请惠予指导学生于1943年2月37日参观电话局及3月5、6日参观电报局致交通部重庆电话局的函",
          date: "19xx年02月02日",
        },
        {
          account: "0344-0001-00456·0000-066·000",
          name: "关于请为刘功樊、程恒茂分配工作致交通部重庆电信局的函",
          date: "1945年09月19日",
        },
        {
          account: "0344-0001-00490·0000-051·000",
          name: "关于请任用电机工程系毕业生李嗣范致交通部电信总局的函",
          date: "19xx年08月29日",
        },
        {
          account: "0344-0001-00498·0000-127·000",
          name: "关于请任用曾垂礼为思想史致交通部电信总局的函",
          date: "19xx年xx月xx日",
        },
        {
          account: "0344-0001-00498·0000-128·000",
          name: "关于请任用谢纯德来渝实习致交通部重庆电信局的函",
          date: "1945年08月26日",
        },
        {
          account: "0344-0001-01456·0000-019·000",
          name: "关于请惠予试验2.6公里径铜包线抗拉结果致国立中央大学的函",
          date: "1936年04月26日",
        },
        {
          account: "0344-0001-01620·0000-033·000",
          name: "关于检送钢包铜线并请测验拉力致国立中央大学材料试验室的函",
          date: "1942年10月20日",
        },
      ],
      SichuanData: [
        {
          account: "M042-001-000283-0082",
          name: "四川省政府关于核办农改所血清厂技佐王祥龙等人任审表件事致四川西康考铨处的公函",
          date: "不详",
        },
        {
          account: "M042-001-000283-0083",
          name: "四川省政府建设厅关于核实农改所血清厂技佐王祥龙等人任审表改填级俸事给四川省政府的呈",
          date: "不详",
        },
        {
          account: "M042-001-000284-0014",
          name: "四川省政府关于核复农改所血清厂总务股长申寿松动态登记表事致四川西康考铨处的公函",
          date: "不详",
        },
        {
          account: "M042-001-000284-0015",
          name: "四川省政府建设厅关于转饬农改所血清厂总务股长申寿松动态登记表等事给四川省政府的呈+通知书1份、动态月报表1份",
          date: "不详",
        },
        {
          account: "M042-001-000284-0033",
          name: "四川省政府关于雇佣杨瑞斌为农改所血清厂技助员事给四川省农业改进所的指令",
          date: "不详",
        },
        {
          account: "M042-001-000284-0034",
          name: "四川省政府人事室关于拟请雇佣杨瑞斌为农改所血清厂技助员事给主席邓锡侯的签呈+呈1件",
          date: "不详",
        },
        {
          account: "M042-001-000284-0041",
          name: "四川省政府建设厅关于核转农改所血清厂技士胡季生任审表证事给四川省政府的呈+审查表1份、履历表1份",
          date: "不详",
        },
        {
          account: "M042-001-000284-0045",
          name: "四川省政府建设厅关于核查农改所血清厂技佐田应劼、棉厂技佐王显来与曾士鸿任审级俸事给四川省政府的呈",
          date: "不详",
        },
        {
          account: "M042-001-000284-0048",
          name: "四川省政府关于核实农改所血清厂股长申寿松动态事给四川省政府建设厅的训令",
          date: "不详",
        },
        {
          account: "M042-001-000284-0049",
          name: "四川西康考铨处关于查知农改所血清厂股长申寿松动态事致四川省政府的公函",
          date: "不详",
        },
      ],
    };
  },
};
</script>

<style scoped>
.all {
  display: flex;
  background-image: url('../../assets/MyMemory/背景3.jpg');
  background-size: cover; /* 确保背景图片覆盖整个元素 */
  background-position: center; /* 背景图片居中显示 */
  background-attachment: fixed; /* 背景图片固定，不随滚动条滚动 */
}
.nav-index {
  position: fixed;
  margin-top: 30px;
  font-family: "华文中宋";
  font-size: large;
  display: flex;
  flex-direction: column;
  margin-left: 20px;
  width: 150px;
  height: 150px;
  background-color: purple;
}
.nav-index a {
  margin-top: 10px;
  text-decoration: none;
  text-align: center;
  color: white;
}
a:hover {
  background: white;
  color: black;
}
.content {
  margin-left: 300px;
  width: 1100px;
  align-items: center;
}
.content h2 {
  color: purple;
  text-align: center;
}
.table {
  border-collapse: collapse;
  margin-top: 30px;
  font-size: large;
  font-family: "华文中宋";
}
.table th,
.table td {
  border: 1px solid #dcdfe6; /* 边框颜色 */
  padding: 8px; /* 内边距 */
}
.table tr {
  border: 1px solid;
}
.his-word {
  margin-top: 30px;
  width: 1000px;
  height: 150px;
  border: 1px solid;
  background-image: url("../../assets/historyDictation/2.png");
  background-size: cover;
}
.his-word p {
  font-family: "华文中宋";
  font-size: x-large;
  text-indent: 2em;
}
</style>
